Revit 2024 API
MetallicPaint.MetallicpaintFlecksColor Property
 The property labeled "Color" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetallicpaintFlecksColor { get; }
Visual Basic
Public Shared ReadOnly Property MetallicpaintFlecksColor As String
	Get
Visual C++
public:
static property String^ MetallicpaintFlecksColor {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace